; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v3 ?v11)
             (pred_10 ?v7 ?v6)
             (pred_4 ?v3 ?v6)
             (pred_11 ?v13 ?v3 )
	     (pred_8 ?v3)
             (pred_2 ?v2)
             (pred_6 ?v7)
             (pred_9 ?v6)
             (pred_3 ?v3)
             (pred_1 ?v7)
             (pred_12 ?v3)
             (pred_5 ))



(:action op_4
:parameters (?v4 ?v1 ?v5 ?v9)
:precondition (and (pred_2 ?v4) (pred_2 ?v1) (pred_6 ?v5) (pred_9 ?v9)
          (pred_7 ?v4 ?v1) (pred_10 ?v5 ?v9)
                   (pred_4 ?v1 ?v9) (pred_8 ?v4) 
                   (pred_3 ?v1) (pred_1 ?v5))
:effect (and  (pred_12 ?v1) (not (pred_3 ?v1))))


(:action op_5
:parameters (?v4 ?v10)
:precondition (and (pred_2 ?v4) (pred_2 ?v10)
               (pred_8 ?v4) (pred_7 ?v4 ?v10) (pred_12 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v4))))

(:action op_3
:parameters (?v4 ?v5)
:precondition (and (pred_2 ?v4) (pred_6 ?v5) 
                  (pred_8 ?v4) (pred_11 ?v5 ?v4) (pred_5 ))
:effect (and (pred_1 ?v5)
   (not (pred_11 ?v5 ?v4)) (not (pred_5 ))))


(:action op_1
:parameters (?v4 ?v8 ?v12)
:precondition (and (pred_2 ?v4) (pred_6 ?v8) (pred_6 ?v12)
                  (pred_8 ?v4) (pred_1 ?v12) (pred_11 ?v8 ?v4))
:effect (and (pred_1 ?v8) (pred_11 ?v12 ?v4)
        (not (pred_1 ?v12)) (not (pred_11 ?v8 ?v4))))

(:action op_2
:parameters (?v4 ?v5)
:precondition (and (pred_2 ?v4) (pred_6 ?v5) 
                  (pred_8 ?v4) (pred_1 ?v5))
:effect (and (pred_5 ) (pred_11 ?v5 ?v4) (not (pred_1 ?v5)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_13 obj_02 obj_03 obj_06 obj_09 obj_01 obj_05 obj_04
    obj_07 obj_10
    obj_08 obj_12
    )

    (:init
       (pred_5)

       (pred_2 obj_11)
       (pred_2 obj_13)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_09)
       (pred_2 obj_01)
       (pred_2 obj_05)
       (pred_2 obj_04)
       (pred_9 obj_07)
       (pred_9 obj_10)
       (pred_6 obj_08)
       (pred_6 obj_12)

       (pred_7 obj_11 obj_03)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_13 obj_06)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_02 obj_09)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_03 obj_01)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_11)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_13)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_02)
       (pred_7 obj_09 obj_06)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_01 obj_03)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_05)
       (pred_3 obj_02)
       (pred_3 obj_06)
       (pred_4  obj_02 obj_07)
       (pred_4  obj_06 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_12 obj_09)
       (pred_12 obj_01)
       (pred_12 obj_05)
       (pred_12 obj_04)

       (pred_10  obj_08 obj_07)
       (pred_10  obj_12 obj_10)
       (pred_11 obj_08 obj_13)
       (pred_11 obj_12 obj_09)
       (pred_8 obj_09)
    )

    (:goal (and
       (pred_11 obj_08 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_06)))
)
)

; plan
1. (op_3 obj_09 obj_12)
   deleted: (pred_11 obj_12 obj_09) (pred_5)
   added: (pred_1 obj_12)
   goals met: 0 of 1
2. (op_4 obj_09 obj_06 obj_12 obj_10)
   deleted: (pred_3 obj_06)
   added: (pred_12 obj_06)
   goals met: 0 of 1
3. (op_2 obj_09 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_5) (pred_11 obj_12 obj_09)
   goals met: 0 of 1
4. (op_5 obj_09 obj_04)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_04)
   goals met: 0 of 1
5. (op_5 obj_04 obj_05)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_05)
   goals met: 0 of 1
6. (op_5 obj_05 obj_01)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_01)
   goals met: 0 of 1
7. (op_5 obj_01 obj_03)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_03)
   goals met: 0 of 1
8. (op_5 obj_03 obj_11)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_11)
   goals met: 0 of 1
9. (op_5 obj_11 obj_13)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_13)
   goals met: 0 of 1
10. (op_3 obj_13 obj_08)
   deleted: (pred_11 obj_08 obj_13) (pred_5)
   added: (pred_1 obj_08)
   goals met: 0 of 1
11. (op_5 obj_13 obj_11)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_11)
   goals met: 0 of 1
12. (op_2 obj_11 obj_08)
   deleted: (pred_1 obj_08)
   added: (pred_5) (pred_11 obj_08 obj_11)
   goals met: 1 of 1
